resume.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-16 Wed 22:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dhaval Patel</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="gruvbox.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Dhaval Patel</h1>
<p>
Markham ON
</p>

<p>
647-861-1597
</p>

<p>
<a href="mailto:dhavalpatel32768@gmail.com"><span class="underline">dhavalpatel32768@gmail.com</span></a>
</p>

<p>
<a href="https://www.linkedin.com/in/dhavalpatel1729"><span class="underline">LinkedIn: dhavalpatel1729</span></a>
</p>

<p>
<a href="https://github.com/dhaval15"><span class="underline">GitHub: dhaval15</span></a>
</p>
<div id="outline-container-orgf3cd678" class="outline-2">
<h2 id="orgf3cd678">Education</h2>
<div class="outline-text-2" id="text-orgf3cd678">
<p>
<b>Master of Science: Big Data Analytics - Trent University</b> -
Peterborough ON, Sept 2021 - Dec 2022
</p>

<p>
<b>Bachelor of Engineering: Computer Engineering - Gujarat Technological
University</b> - Gujarat India, July 2016 - April 2020
</p>
</div>
</div>

<div id="outline-container-orga79c324" class="outline-2">
<h2 id="orga79c324">Technical Skills</h2>
<div class="outline-text-2" id="text-orga79c324">
<p>
<b>Programming Languages</b>: Python, R, SQL, Java, Dart, Kotlin
</p>

<p>
<b>Operating Systems</b>: Windows, Linux (Debian, Fedora, Arch)
</p>

<p>
<b>Databases</b>: SQL, MySQL, SQLite, MongoDB
</p>

<p>
<b>Cloud Technologies</b>: Amazon Web Services (AWS), Google Cloud Platform
(GCP)
</p>

<p>
<b>Web Technologies</b>: HTML, CSS, JavaScript
</p>

<p>
<b>Software Tools</b>: Git, Postman, MS Office, PowerBI, Tableau
</p>

<p>
<b>Frontend Frameworks</b>: Flutter, Android SDK
</p>

<p>
<b>Design Tools:</b> Figma, Adobe XD
</p>
</div>
</div>

<div id="outline-container-org6fe2161" class="outline-2">
<h2 id="org6fe2161">Skills</h2>
<div class="outline-text-2" id="text-org6fe2161">
<ul class="org-ul">
<li>Experience  working with  various  databases including  MySQL,
SQLite, MongoDB</li>
<li>Experience of working with  various frontend technologies such
as Flutter, ReactJS and Native Android App Development.</li>
<li>Hands-on  experience  with   connecting  remote  databases  to
front-end applications.</li>
<li>Experience  on  working with  Google  Cloud  Platform and  AWS
services.</li>
<li>Extensive usage  of Git version control,  bug reporting, issue
tracking.</li>
<li>Implementation of  Figma and  AdobeXD designs into  Flutter as
well as Android XML user interfaces.</li>
<li>Building  Data Visualisation  using Python  and R  as well  as
PowerBI and Tableau</li>
<li>Extracting meaningful insights from data and writing reports.</li>
<li>Knowledge of working with various office tools: MS Office</li>
<li>Knowledge of various methodologies including Agile and Scrum.</li>
<li>Experience working on Big Data framework such as Apache Kafka,
Spark, Hadoop</li>
<li>Experience  in Machine  Learning framework  including PyTorch,
TensorFlow</li>
<li>High writing skills and verbal communication skills</li>
<li>Problem solving and Report generation and presentation</li>
</ul>
</div>
</div>

<div id="outline-container-org4294e14" class="outline-2">
<h2 id="org4294e14">Certifications</h2>
<div class="outline-text-2" id="text-org4294e14">
<ul class="org-ul">
<li>The Ultimate Hands-On Flutter &amp; MVVM - Build Real Projects on
Udemy</li>
<li>The Complete Flutter  UI Masterclass for iOS,  Android, &amp; Web
on Udemy</li>
<li>Android App  Development with  Java and  Kotlin at  Tops Int,
Ahmedabad India</li>
</ul>
</div>
</div>

<div id="outline-container-org7d97290" class="outline-2">
<h2 id="org7d97290">Professional Experience</h2>
<div class="outline-text-2" id="text-org7d97290">
</div>
<div id="outline-container-jr.-application-developer-sept-2020---aug-2021" class="outline-3">
<h3 id="jr.-application-developer-sept-2020---aug-2021">Jr. Application Developer Sept 2020 - Aug 2021</h3>
<div class="outline-text-3" id="text-jr.-application-developer-sept-2020---aug-2021">
<p>
<b>Vishwam Cable Networks</b> - Ahmedabad, India
</p>

<ul class="org-ul">
<li>Worked as full  time app developer and  executed the migration
of the  application from Android  SDK to Flutter  and extended
the  reach  of  the  application  by 20%  using  iOS  and  Web
Implementation.</li>
<li>Implementing  User  Interface  from  Figma  into  Flutter  and
co-ordinate feedback to the designing team.</li>
<li>Improved app workflow with  better design and integration with
the native platform.</li>
<li>Assured  app  reliability  by   performing  unit  testing  for
features implementation.</li>
<li>Coordinated with the Product  owner about the responsibilities
as well as expectations of the product.</li>
</ul>
</div>
</div>

<div id="outline-container-application-developer-internship-mar-2020---aug-2020" class="outline-3">
<h3 id="application-developer-internship-mar-2020---aug-2020">Application Developer Internship Mar 2020 - Aug 2020</h3>
<div class="outline-text-3" id="text-application-developer-internship-mar-2020---aug-2020">
<p>
<b>Vishwam Cable Networks</b> - Ahmedabad, India
</p>
<ul class="org-ul">
<li>Worked  as  an  intern,  assisting  developing  a  front-end
application  using  Android  SDK, which  provided  consumers
authentication and trouble-shooting  services for Television
and Internet.</li>
<li>Produced  feedback reports  collected from  customer surveys
and  coordinated  the  improved  workflows  to  the  project
manager.</li>
<li>Worked on Research proposal  for movement of the application
to  Flutter framework  for better  outreach and  coordinated
with  the   project  manager  about  the   requirements  and
responsibilities.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge00eacc" class="outline-2">
<h2 id="orge00eacc">Academic Projects</h2>
<div class="outline-text-2" id="text-orge00eacc">
</div>
<div id="outline-container-sentiment-analysis-on-customer-reviews" class="outline-3">
<h3 id="sentiment-analysis-on-customer-reviews">Sentiment Analysis on Customer Reviews</h3>
<div class="outline-text-3" id="text-sentiment-analysis-on-customer-reviews">
<ul class="org-ul">
<li>Performed  sentiment analysis  on  customer  reviews of  two
competitive products over a period  of span to establish the
impact of performance of one product on customer's sentiment
on other products.</li>
<li>Reviewed  more  than 20  peer  reviewed  research papers  on
product   review  analysis   and   produced  a   substantial
literature review on product review analysis.</li>
<li>Proposed  literature   gaps  found  in  the   state  of  art
techniques used  to understand product reviews  and feedback
cycles.</li>
</ul>
<p>
<b>Technologies:</b> Python
</p>
</div>
</div>

<div id="outline-container-intelliroute" class="outline-3">
<h3 id="intelliroute">IntelliRoute</h3>
<div class="outline-text-3" id="text-intelliroute">
<ul class="org-ul">
<li>Built a dashboard application  as well as client application
using Flutter SDK for intra-campus transport system</li>
<li>Used google  cloud platform services such  as authentication
and realtime database.</li>
<li>Backed  the dashboard  using people  flow analysis  over the
whole campus  and finding best routes  for optimal transport
infrastructure implementation.</li>
</ul>
<p>
<b>Technologies:</b>  Flutter  SDK,  Google  Cloud  Platform,  Node.js,
Firebase Database, Python
</p>
</div>
</div>

<div id="outline-container-offerhunt" class="outline-3">
<h3 id="offerhunt">OfferHunt</h3>
<div class="outline-text-3" id="text-offerhunt">
<ul class="org-ul">
<li>Developed    an    android   application    using    Flutter
cross-platform SDK  which provided a platform  to local shop
owners to  publish advertisements and offers  which then can
be consumed by a large consumer base in a nearby area.</li>
</ul>
<p>
<b>Technologies:</b>  Flutter  SDK,  Google  Cloud  Platform,  Node.js,
Firebase Database
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-11-16 Wed 22:03</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
